OpenFOAM-v2112-AD/applications/discreteAdjointOpenFOAM/tangent/t1sSimpleFoam/pitzDaily/Allrun
#!/bin/bash
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

cp -r 0.org 0
blockMesh
t1sSimpleFoam
